requests/OTA_AirAvailLLSRQ2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext"
                  xmlns:mes="http://www.ebxml.org/namespaces/messageHeader"
                  xmlns:ns="http://webservices.sabre.com/sabreXML/2003/07">
  <soapenv:Header>
    <sec:Security>
      <!--Optional:-->
      <sec:UsernameToken>
        <!--Optional:-->
        <sec:Username>?</sec:Username>
        <!--Optional:-->
        <sec:Password>?</sec:Password>
        <!--0 to 2 repetitions:-->
        <sec:NewPassword>?</sec:NewPassword>
        <!--Optional:-->
        <Organization>?</Organization>
        <!--Optional:-->
        <Domain>?</Domain>
      </sec:UsernameToken>
      <!--Optional:-->
      <sec:SabreAth>?</sec:SabreAth>
      <!--Optional:-->
      <sec:BinarySecurityToken>?</sec:BinarySecurityToken>
    </sec:Security>
    <mes:MessageHeader mes:id="?" mes:version="?">
      <mes:From>
        <!--1 or more repetitions:-->
        <mes:PartyId mes:type="?">?</mes:PartyId>
        <!--Optional:-->
        <mes:Role>?</mes:Role>
      </mes:From>
      <mes:To>
        <!--1 or more repetitions:-->
        <mes:PartyId mes:type="?">?</mes:PartyId>
        <!--Optional:-->
        <mes:Role>?</mes:Role>
      </mes:To>
      <mes:CPAId>?</mes:CPAId>
      <mes:ConversationId>?</mes:ConversationId>
      <mes:Service mes:type="?">?</mes:Service>
      <mes:Action>?</mes:Action>
      <mes:MessageData>
        <mes:MessageId>?</mes:MessageId>
        <mes:Timestamp>?</mes:Timestamp>
        <!--Optional:-->
        <mes:RefToMessageId>?</mes:RefToMessageId>
        <!--Optional:-->
        <mes:TimeToLive>?</mes:TimeToLive>
        <!--Optional:-->
        <mes:Timeout>?</mes:Timeout>
      </mes:MessageData>
      <!--Optional:-->
      <mes:DuplicateElimination>?</mes:DuplicateElimination>
      <!--Zero or more repetitions:-->
      <mes:Description xml:lang="?">?</mes:Description>
      <!--You may enter ANY elements at this point-->
    </mes:MessageHeader>
  </soapenv:Header>
  <soapenv:Body>
    <ns:OTA_AirAvailRQ EchoToken="?" TimeStamp="?" Target="Production" Version="?" SequenceNmbr="?"
                       PrimaryLangID="?" AltLangID="?">
      <!--Optional:-->
      <ns:POS>
        <!--Optional:-->
        <ns:Source PseudoCityCode="?" />
      </ns:POS>
      <!--Optional:-->
      <ns:TPA_Extensions>
        <!--Optional:-->
        <ns:MessagingDetails>
          <!--Optional:-->
          <ns:MDRSubset Code="?" />
        </ns:MessagingDetails>
      </ns:TPA_Extensions>
      <!--Optional:-->
      <ns:OriginDestinationInformation ExcludeCodeShare="false">
        <!--Optional:-->
        <ns:DepartureDateTime WindowBefore="?" WindowAfter="?" DateTime="?">?</ns:DepartureDateTime>
        <!--Optional:-->
        <ns:OriginLocation LocationCode="?" CodeContext="IATA" />
        <!--Optional:-->
        <ns:TPA_Extensions>
          <!--Optional:-->
          <ns:Scan Ind="?" />
          <!--Optional:-->
          <ns:ArrivalDateTime WindowBefore="?" WindowAfter="?" DateTime="?" />
        </ns:TPA_Extensions>
        <!--Optional:-->
        <ns:DestinationLocation LocationCode="?" CodeContext="IATA" />
        <!--Optional:-->
        <ns:ConnectionLocations>
          <!--Zero or more repetitions:-->
          <ns:ConnectionLocation LocationCode="?" CodeContext="IATA" MinChangeTime="?"
                                 MaxChangeTime="?">
            <!--Optional:-->
            <ns:TPA_Extensions>
              <!--Optional:-->
              <ns:ExcludeCodeshare Ind="false" />
              <!--Zero or more repetitions:-->
              <ns:Airline Code="?" Any="false" Exclude="false" />
            </ns:TPA_Extensions>
          </ns:ConnectionLocation>
        </ns:ConnectionLocations>
      </ns:OriginDestinationInformation>
      <!--Optional:-->
      <ns:SpecificFlightInfo>
        <!--Optional:-->
        <ns:FlightNumber Number="?" />
        <!--Optional:-->
        <ns:Airline Code="?">?</ns:Airline>
        <!--Optional:-->
        <ns:BookingClassPref ResBookDesigCode="?" />
        <!--Optional:-->
        <ns:TPA_Extensions>
          <!--Optional:-->
          <ns:DepartureDateTime WindowBefore="?" WindowAfter="?" DateTime="?" />
          <!--Optional:-->
          <ns:OriginLocation LocationCode="?" CodeContext="IATA" />
          <!--Optional:-->
          <ns:DestinationLocation LocationCode="?" CodeContext="IATA" />
          <!--Optional:-->
          <ns:AdditionalAvail Ind="false" ClassInd="false" MoveDown="false" />
        </ns:TPA_Extensions>
      </ns:SpecificFlightInfo>
      <!--Optional:-->
      <ns:TravelPreferences MaxStopsQuantity="?">
        <!--Zero or more repetitions:-->
        <ns:VendorPref Code="?" />
        <!--Optional:-->
        <ns:CabinPref Number="?" Cabin="?" />
        <!--Optional:-->
        <ns:TPA_Extensions>
          <!--Zero or more repetitions:-->
          <ns:ExcludeVendorPref Code="?" />
          <!--Optional:-->
          <ns:PromotionalSpot CodeType="?" />
          <!--Optional:-->
          <ns:CharteredAirline Desired="false" />
          <!--Optional:-->
          <ns:DirectAccess Ind="false" />
        </ns:TPA_Extensions>
      </ns:TravelPreferences>
    </ns:OTA_AirAvailRQ>
  </soapenv:Body>
</soapenv:Envelope>
